# This program demonstrate example of executing SQL query using SqlAlchemy

In [1]:
#Import Libraries
import pandas as pd 
import os 
import csv 
from config import db_password

In [2]:
import sqlalchemy as db
from sqlalchemy import create_engine
import psycopg2

In [ ]:
#Data base connection string
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/DataAnalyticsProject"
db_string

In [4]:
#Create engine
engine = create_engine(db_string)

In [5]:
#Retrieve the table data Merged_M5000 from pgadmin
metadata = db.MetaData()
Merged_M5000 = db.Table('Merged_M5000', metadata, autoload=True, autoload_with=engine)

In [6]:
#Display the Column names
print(Merged_M5000.columns.keys())

['Area_Code', 'Area', 'Item_Code', 'Item', 'Element_Code', 'Element', 'Year', 'Population', 'Emission']

In [7]:
#Select the data
query = db.select([Merged_M5000])

In [8]:
#Execute the query
Result1 = engine.execute(query)

In [9]:
#Fetch all data
ResultSet = Result1.fetchall()

In [10]:
#Displaying the first 4 Rows
ResultSet[:4]

[(5000, 'World', 5058, 'Enteric Fermentation', 7225, 'Emissions (CH4)', 1990, 5327231.061, 89059.6919),
 (5000, 'World', 5058, 'Enteric Fermentation', 724413, 'Emissions (CO2eq) from CH4 (AR5)', 1990, 5327231.061, 2493671.372),
 (5000, 'World', 5058, 'Enteric Fermentation', 723113, 'Emissions (CO2eq) (AR5)', 1990, 5327231.061, 2493671.372),
 (5000, 'World', 5059, 'Manure Management', 7225, 'Emissions (CH4)', 1990, 5327231.061, 9261.0769)]

In [11]:
#Moving the results to a data frame
df=pd.DataFrame(ResultSet)
df.head()

,0,1,2,3,4,5,6,7,8
0,5000,World,5058,Enteric Fermentation,7225,Emissions (CH4),1990,5327231.061,8.905969e+04
1,5000,World,5058,Enteric Fermentation,724413,Emissions (CO2eq) from CH4 (AR5),1990,5327231.061,2.493671e+06
2,5000,World,5058,Enteric Fermentation,723113,Emissions (CO2eq) (AR5),1990,5327231.061,2.493671e+06
3,5000,World,5059,Manure Management,7225,Emissions (CH4),1990,5327231.061,9.261077e+03
4,5000,World,5059,Manure Management,7230,Emissions (N2O),1990,5327231.061,4.550201e+02

# Below is an example of joinning two postgres tables 'Area' and 'Emission'

In [12]:
#Creating variables for the two table data storage
metadata = db.MetaData()
Area = db.Table('Area', metadata, autoload=True, autoload_with=engine)
Emission = db.Table('Emission', metadata, autoload=True, autoload_with=engine)

In [13]:
#Querying the data and displaying the results as a data frame
query = db.select([Area,Emission])
query = query.select_from(Emission.join(Area,Area.columns.Area_Code==Emission.columns.Area_Code))
results = engine.execute(query).fetchall()
df = pd.DataFrame(results)
df.head(5)

    0       1   2      3       4     5       6
0  18  Bhutan  18  69921  724413  2019  0.0582
1  18  Bhutan  18  69921  724413  2018  0.9318
2  18  Bhutan  18  69921  724413  2017  0.7571
3  18  Bhutan  18  69921  724413  2016  1.1066
4  18  Bhutan  18  69921  724413  2015  6.8722